# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManagerIterator..::..Dispose Method
MacroManagerIterator Class See Also
---
Releases all resources used by the MacroManagerIterator
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace